//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
public class Main {

    public static void main(String[] args) {

        //это коментарий
        //Написать програму,которая выводит на экран фразу "Я изучаю программирование!".

        System.out.println("Я изучаю програмированье!");

        /*
        это
        многострочный
        коментарий
        Написать программу, которая выводит на экран результат сложения чисел 10 и 20
         */

        System.out.println("10 + 20 = " + (10+20));


    }


}